---
kind: type
id: T:Autodesk.Revit.DB.LayoutRuleClearSpacing
source: html/09ba6ef0-6c4d-904a-715a-33755540fd26.htm
---
# Autodesk.Revit.DB.LayoutRuleClearSpacing

This class indicate the layout rule of a Beam System is Clear-Spacing.

## Syntax (C#)
```csharp
public class LayoutRuleClearSpacing : LayoutRule
```

## Remarks
To use this type of LayoutRule, the distance between the beams and the justify-type must be set.